import React, { Component} from 'react';
import castle1 from './castle1.jpg';
import castle2 from './castle2.jpg';
import castle3 from './castle3.jpg';
import castle4 from './castle4.jpg';

class ZbarazhCastle extends Component{
    render(){
        return(
            <div>
                <div>
                    Локація №10 : Збаражський Замок
                </div>
                <div>
                    Саме зараз ви знаходитесь на Замковій горі.
                </div>
                <div>
                    Перший Збаразький замок звів 1393 року князь Дмитро-Корибут на Княжій горі в нинішньому приміському селі 
                    Старий Збараж. Його зруйнували татари в 1474, 1598 роках.
                </div>
                <div>
                    Замок споруджено в 1626–1631 рр. за проектом італійського архітектора Вінченцо Скамоцці під керівництвом 
                    військового інженера Андреа дель Аква, ймовірно, Г. ван Пеена коштом Христофора Збаразького. Проект замку 
                    В. Скамоцци спочатку описав у трактаті «Про ідею універсальної архітектури» (інший переклад — «Ідея загальної 
                    архітектури», Венеція, 1615 р.), потім був втілений у Збаражі. 1675 року замок захопили, спалили турки.
                </div>
                <div>
                    <img className='img_content' src={castle1} />
                </div>
                <div>
                    Збаразький замок квадратний у плані, зведений на пагорбі. Цоколь мурований із каменю, верх — із цегли, стіни 
                    обкладені тесаним пісковиком. Укріплення було оточене ровом 40 м, валом шириною 23 м. Рів за допомогою 
                    гідротехнічної системи наповнювали водою. З кожного бастіону на кутах ходи вели до палацу. Зі сходу фортецю 
                    оточували ліси, стави й болота, із заходу і півночі — високі береги річки Гнізна, з півдня — крутий яр. За 
                    початковим планом бічні сторони мали дорівнювати діагоналі квадрата, проведеного по осі головного фасаду.
                </div>
                <div>
                    Цікавим є те що влітку 1649 року коронне військо, укріпившись у таборі біля замку, витримало тривалу облогу 
                    козацько-селянського війська під проводом Б. Хмельницького і його союзників-татар. 1675 року фортецю пошкоджено 
                    турецько-татарською армією під проводом Ібраґіма-Шишмана.
                </div>
                <div>
                    <img className='img_content' src={castle2} />
                </div>
                <div>
                    Сучасний ансамбль замкових споруд склався протягом ряду пізніших перебудов. У середині XIX ст. тут працював 
                    цукровий завод, під керівництвом генерала Бема. 1896 року в замковому палаці відбулась пожежа. У 1920—1930-ті 
                    роки, організацією польських офіцерів запасу було здійснено відповідні роботи з відбудови замкового палацу, 
                    з подальшими планами по пристосуванню його під гімназію. Ці плани не вдалось завершити через початок Другої 
                    Світової війни в 1939 році. Згодом — у 1984 році, тут відкрито молодіжний культурно-спортивний комплекс. 
                    За часів нової незалежності України, з 1994 року в палаці Збаразького замку розмістився  краєзнавчий музей. 
                    У цьому ж році Збаразький замок став архітектурною пам'яткою, новоствореного Державного історико-архітектурного 
                    заповідника міста Збаража. В січні 2005 року заповіднику надано статус національного, з назвою: Національний заповідник 
                    «Замки Тернопілля», основним осередком якого став Збаразький замок. Замок квадратний у плані, оточений з усіх боків 
                    болотами. Укріплення замку, які відображали найновіші досягнення європейського фортифікаційного мистецтва, 
                    складалися з казематових валів з ескарпами, чотирьох бастіонів і рову, який оточував весь замок. Сам палац 
                    двоповерховий, кам'яний, потинькований, з характерними для ренесансу спрощеними формами.
                </div>
                <div>
                    У повоєнний період в замку містилися карцери НКВС, де знищено десятки людей, тіла яких скидали до криниці на подвір'ї 
                    замку та заливали бетоном. На початку 1990-х років останки було перепоховано на цвинтарі місцевими мешканцями.
                </div>
                <div>
                    Від 1994 року 3баразький замок входить до комплексу споруд 3баразького державного історико-архітектурного заповідника.
                </div>
                <div>
                    <img className='img_content' src={castle3} />
                </div>
                <div>
                    На території замку можна провести захопливі фотосесії родинами або дружніми компаніями в обладунках лицарів. А для 
                    сміливих та відважних є можливість відчути атмосферу нічного замку.
                </div>
                <div>
                    А ще тут існує лицарський клуб «Збаразький гарнізон», який займається  постановкою боїв Середньовіччя, історичною 
                    реконструкцією битв та ще іншими цікавими дійствами.
                </div>
                <div>
                    <img className='img_content' src={castle4} />
                </div>
                <div>
                    Поряд із замком є чудовий парк, де ви можете відпочити, прогулятись  та насолодитись природою. Неподалік також знаходиться 
                    оглядовий майданчик де ви зможете побачити чудовий краєвид на Збаразьке озеро.
                </div>
                <div>
                    На цьому наш квест закінчується. Дякуємо, що довірилися та пізнали місто Збараж разом із нами.
                </div>
            </div>
        )
    }
}

export default ZbarazhCastle;