import React, { Component } from 'react';
import { Link } from 'react-router-dom';


class Text extends Component {
    render() {
        return (
            <div>
                <div className='title_head'>
                    <div>
                        Локація №9: Теребовлянський коледж культур і мистецтв
                    </div>
                    <Link to='/terebovlia/start'>
                        <div>Початок квесту тут...</div>
                    </Link>
                </div>
                <div>
                    Саме так, як ви уже встигли помітити, це є пам’ятник абітурієнту. Згадали, як колись самі так сиділи на лавочці перед омріяним ВУЗом?
                    Або, можливо, у вас ще це попереду.
                </div>
                <ul>
                    Цікавинки:
                    <li>
                        Це перший пам’ятник абітурієнту в Україні.
                    </li>
                    <li>
                        Виконали бронзову інсталяцію з бетону студенти відділу декоративно-прикладного мистецтва Ікал Надія,
                        Сметана Діана, Володимир Багрій та Мануляк Михайло під керівництвом викладача Олега Котика. Парубка, якого назвали Славком,
                        зробили в образі абітурієнта, який приїхав навчатися, але з професією ще не визначився.
                    </li>
                    <li>
                        Скульптуру назвали "На роздоріжжі" - випускник школи сидить на лавці і розмірковує над вибором фаху. Поруч нього наплічник з палітрою,
                        а біля ніг - футляр для музичного інструменту. Хлопець читає та водночас слухає музику з мобільного телефону.
                    </li>
                    <li>
                        Вже навіть з’явилась легенда, що якщо посидиш поряд із ним, то обов’язково поступиш в омріяний ВУЗ.
                    </li>
                </ul>
            </div>
        )
    }
}

export default Text;